# Brewfile - Homebrew package management
# Install with: brew bundle --file=~/dotfiles/Brewfile

# CLI Tools
brew "bat"
brew "chezmoi"
brew "curl"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "nvm"  # Node version manager (install node via: nvm install node)
brew "openssh"
brew "python@3.14"
brew "pyenv"
brew "ripgrep"
brew "starship"  # Fast, customizable shell prompt
brew "tree"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Cask Applications
cask "1password"
cask "1password-cli"
cask "calibre"
cask "cursor"
cask "discord"
cask "helium-browser"
cask "mullvad-browser"
cask "obsidian"
cask "pearcleaner"
cask "rectangle-pro"
cask "slack"
cask "vscodium"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
